{
  "nodes": [
    {
      "id": "1",
      "term": "Текстовый майнинг",
      "definition": "Процесс извлечения интересной и полезной информации из текстовых данных. Включает в себя использование методов обработки естественного языка (NLP), статистики и машинного обучения для анализа и понимания текстов.",
      "coordinate": {
        "x": 1127,
        "y": 5
      }
    },
    {
      "id": "2",
      "term": "Обработка естественного языка (NLP)",
      "definition": "Область исследования, связанная с взаимодействием между компьютерами и человеческим языком. Включает в себя методы анализа и понимания текста, а также создание систем, способных обрабатывать естественный язык.",
      "coordinate": {
        "x": 346,
        "y": -7
      }
    },
    {
      "id": "3",
      "term": "Токенизация",
      "definition": "Процесс разделения текста на отдельные элементы, называемые токенами. Токены могут быть словами, фразами или другими смысловыми единицами.",
      "coordinate": {
        "x": 455,
        "y": 160
      }
    },
    {
      "id": "4",
      "term": "Предобработка данных",
      "definition": "Процесс подготовки данных перед их использованием в анализе или обучении модели. Включает в себя удаление шума, нормализацию, заполнение пропущенных значений и другие шаги для обеспечения качественного анализа данных.",
      "coordinate": {
        "x": 635,
        "y": 164
      }
    },
    {
      "id": "5",
      "term": "Извлечение признаков",
      "definition": "Процесс выделения ключевых характеристик из данных, которые наиболее информативны для решения конкретной задачи. В контексте машинного обучения это может включать в себя выделение значимых признаков из текста, изображений и других типов данных.",
      "coordinate": {
        "x": 183,
        "y": 113
      }
    },
    {
      "id": "6",
      "term": "Мешок слов (BoW)",
      "definition": "Метод представления текста в виде набора слов без учета порядка. Каждое слово считается отдельным элементом и учитывается его частота в тексте. Используется в анализе текстов для создания векторного представления документов.",
      "coordinate": {
        "x": 38,
        "y": 252
      }
    },
    {
      "id": "7",
      "term": "Частота термина-обратная частота документа (TF-IDF)",
      "definition": "Метод взвешивания слов в тексте, основанный на их частоте (TF) и обратной частоте документа (IDF). Выделяет важные слова, которые часто встречаются в конкретном документе, но редко встречаются в других документах.",
      "coordinate": {
        "x": 78,
        "y": 339
      }
    },
    {
      "id": "8",
      "term": "Векторные представления слов",
      "definition": "Метод представления слов в виде векторов чисел. Каждое слово представлено точкой в многомерном пространстве, где семантически близкие слова находятся близко друг к другу. Используется для работы семантического анализа в текстах.",
      "coordinate": {
        "x": 356,
        "y": 256
      }
    },
    {
      "id": "9",
      "term": "Машинное обучение",
      "definition": "Область исследования, в которой компьютерные системы обучаются автоматически улучшать свое поведение на основе опыта. Включает в себя различные методы, такие как классификация, регрессия, кластеризация и обучение с подкреплением.",
      "coordinate": {
        "x": 698,
        "y": 353
      }
    },
    {
      "id": "10",
      "term": "Метод опорных векторов (SVM)",
      "definition": "Алгоритм машинного обучения для задач классификации и регрессии. Создает гиперплоскость в многомерном пространстве, разделяющую объекты разных классов. Цель - максимизировать расстояние между гиперплоскостью и ближайшими объектами каждого класса.",
      "coordinate": {
        "x": 1134,
        "y": 391
      }
    },
    {
      "id": "11",
      "term": "Наивный байесовский классификатор",
      "definition": "Статистический алгоритм классификации, основанный на теореме Байеса. Предполагает независимость признаков и используется для прогнозирования принадлежности объекта к определенному классу. Часто применяется в задачах фильтрации спама, анализе тональности и других.",
      "coordinate": {
        "x": 207,
        "y": 446
      }
    },
    {
      "id": "12",
      "term": "Нейронные сети",
      "definition": "Система компьютерных алгоритмов, моделирующих структуру и функцию человеческого мозга. Состоит из нейронов, объединенных слоями. Используется для решения различных задач, включая распознавание образов, обработку естественного языка и игры.",
      "coordinate": {
        "x": 695,
        "y": 477
      }
    },
    {
      "id": "13",
      "term": "Рекуррентная нейронная сеть (RNN)",
      "definition": "Тип нейронной сети, способной обрабатывать последовательные данные. Имеет обратные связи между нейронами, что позволяет ей учитывать предыдущие состояния при обработке новой информации. Широко используется в задачах, связанных с последовательностями.",
      "coordinate": {
        "x": 836,
        "y": 606
      }
    },
    {
      "id": "14",
      "term": "Долгая краткосрочная память (LSTM)",
      "definition": "Вариант рекуррентной нейронной сети (RNN), спроектированный для решения проблемы затухающего градиента. Обладает способностью запоминать и забывать информацию на длительные периоды времени. Широко используется в обработке естественного языка и других задачах.",
      "coordinate": {
        "x": 1318,
        "y": 603
      }
    },
    {
      "id": "15",
      "term": "Сверточная нейронная сеть (CNN)",
      "definition": "Тип нейронной сети, специализированный для обработки входных данных сеткой свертки. Эффективно используется в задачах компьютерного зрения для распознавания образов и классификации изображений.",
      "coordinate": {
        "x": 992,
        "y": 510
      }
    },
    {
      "id": "16",
      "term": "Word2Vec",
      "definition": "Метод создания векторных представлений слов на основе их контекста. Использует нейронные сети для обучения векторов, представляющих семантическую близость слов. Широко применяется в задачах анализа текста и поиска схожих слов.",
      "coordinate": {
        "x": 581,
        "y": 612
      }
    },
    {
      "id": "17",
      "term": "GloVe",
      "definition": "Метод создания векторных представлений слов, основанный на глобальной статистике совстречаемости слов. Учитывает вероятность встречаемости слов в одном контексте. Применяется для получения более точных и семантически близких векторных представлений слов.",
      "coordinate": {
        "x": 736,
        "y": 622
      }
    },
    {
      "id": "18",
      "term": "Предварительно обученные модели",
      "definition": "Модели машинного обучения, обученные на больших наборах данных и доступные для использования в других задачах. Позволяют извлекать знания, полученные из обширных данных, без необходимости обучения модели с нуля.",
      "coordinate": {
        "x": 178,
        "y": 551
      }
    },
    {
      "id": "19",
      "term": "Классификация",
      "definition": "Задача машинного обучения, в которой система разделяет объекты на заранее определенные категории или классы на основе их характеристик. Применяется для прогнозирования принадлежности объекта к определенному классу.",
      "coordinate": {
        "x": 982,
        "y": 266
      }
    },
    {
      "id": "20",
      "term": "Оценка модели",
      "definition": "Процесс измерения производительности модели машинного обучения. Включает в себя использование метрик, таких как точность, полнота, F-мера и других, для оценки того, насколько хорошо модель справляется с поставленной задачей.",
      "coordinate": {
        "x": 857,
        "y": 76
      }
    },
    {
      "id": "21",
      "term": "Гиперонимия",
      "definition": "Отношение между словами, при котором одно слово является более общим или обобщающим, чем другое. Например, 'плод' является гиперонимом для 'яблоко' и 'груша'.",
      "coordinate": {
        "x": 1476,
        "y": 14
      }
    },
    {
      "id": "22",
      "term": "Лексико-основанные методы",
      "definition": "Методы анализа текста, основанные на лексических или словесных характеристиках. Включают в себя использование словарей, стоп-слов, частоты слов и других лексических признаков для анализа и классификации текстовых данных.",
      "coordinate": {
        "x": 1349,
        "y": 179
      }
    },
    {
      "id": "23",
      "term": "Аспектно-ориентированный анализ тональности",
      "definition": "Анализ тональности, направленный на выделение и оценку эмоциональных отзывов или высказываний по отношению к конкретным аспектам продукта, услуги или события. Позволяет понять отношение к различным характеристикам.",
      "coordinate": {
        "x": 1186,
        "y": 261
      }
    },
    {
      "id": "24",
      "term": "Майнинг социальных медиа",
      "definition": "Процесс извлечения и анализа информации из социальных медиа-платформ. Включает в себя мониторинг обсуждений, анализ тональности, выявление трендов и другие методы для извлечения ценной информации из данных социальных медиа.",
      "coordinate": {
        "x": 1360,
        "y": 106
      }
    }
  ],
  "links": [
    {
      "source": "1",
      "target": "2",
      "relation": "включает"
    },
    {
      "source": "2",
      "target": "3",
      "relation": "использует"
    },
    {
      "source": "2",
      "target": "4",
      "relation": "включает"
    },
    {
      "source": "2",
      "target": "5",
      "relation": "включает"
    },
    {
      "source": "5",
      "target": "6",
      "relation": "включает"
    },
    {
      "source": "5",
      "target": "7",
      "relation": "включает"
    },
    {
      "source": "5",
      "target": "8",
      "relation": "включает"
    },
    {
      "source": "9",
      "target": "10",
      "relation": "использует"
    },
    {
      "source": "9",
      "target": "11",
      "relation": "использует"
    },
    {
      "source": "9",
      "target": "12",
      "relation": "использует"
    },
    {
      "source": "12",
      "target": "13",
      "relation": "состоит из"
    },
    {
      "source": "13",
      "target": "14",
      "relation": "состоит из"
    },
    {
      "source": "12",
      "target": "15",
      "relation": "состоит из"
    },
    {
      "source": "12",
      "target": "16",
      "relation": "использует"
    },
    {
      "source": "12",
      "target": "17",
      "relation": "использует"
    },
    {
      "source": "12",
      "target": "18",
      "relation": "использует"
    },
    {
      "source": "1",
      "target": "19",
      "relation": "включает"
    },
    {
      "source": "19",
      "target": "9",
      "relation": "использует"
    },
    {
      "source": "1",
      "target": "20",
      "relation": "включает"
    },
    {
      "source": "1",
      "target": "21",
      "relation": "включает"
    },
    {
      "source": "1",
      "target": "22",
      "relation": "включает"
    },
    {
      "source": "1",
      "target": "23",
      "relation": "включает"
    },
    {
      "source": "1",
      "target": "24",
      "relation": "включает"
    }
  ]
}
